import 'package:werdy/models/dhikr.dart';

class AdhkarData {
  static final List<Dhikr> morningAdhkar = [
    Dhikr(
      text: 'أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لاَ إِلَـهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ.',
      count: 1,
    ),
    Dhikr(
      text: 'اللَّهُمَّ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ وَإِلَيْكَ النُّشُورُ.',
      count: 1,
    ),
    Dhikr(
      text: 'سُبْحَانَ اللهِ وَبِحَمْدِهِ.',
      count: 100,
    ),
  ];

  static final List<Dhikr> eveningAdhkar = [
    Dhikr(
      text: 'أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لاَ إِلَـهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ.',
      count: 1,
    ),
    Dhikr(
      text: 'اللَّهُمَّ بِكَ أَمْسَيْنَا، وَبِكَ أَصْبَحْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ وَإِلَيْكَ الْمَصِيرُ.',
      count: 1,
    ),
    Dhikr(
      text: 'أَسْتَغْفِرُ اللهَ وَأَتُوبُ إِلَيْهِ.',
      count: 100,
    ),
  ];
}
